<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.behrtorinho.jss.MicrosoftYammer-Autoupdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft Office</string>
		<key>DOWNLOADURL</key>
		<string>https://aka.ms/yammer_desktop_mac</string>
		<key>GROUP_NAME</key>
		<string>update-automatic-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/SmartGroupTemplate-autoupdate.xml</string>
		<key>NAME</key>
		<string>Microsoft Yammer</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Automaticly</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/PolicyTemplate-autoupdate.xml</string>
		<key>SOFTWARETITLE</key>
		<string>Yammer</string>
		<key>VENDOR</key>
		<string>Microsoft</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.jss.microsoftyammer</string>
</dict>
</plist>
