<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.behrtorinho.jss.CitrixWorkspace-Pilotgroup</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Virtualization</string>
		<key>GROUP_NAME</key>
		<string>update-pilotgroup-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/SmartGroupTemplate-pilotgroup.xml</string>
		<key>NAME</key>
		<string>Citrix Workspace</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Pilotgroup</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/PolicyTemplate-pilotgroup.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Citrix Workspace is the easy-to-install client software that provides access to your Citrix XenDesktop and XenApp installations.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/CitrixWorkspace.png</string>
		<key>SOFTWARETITLE</key>
		<string>Workspace</string>
		<key>VENDOR</key>
		<string>Citrix</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.jss.citrixworkspace</string>
</dict>
</plist>
