<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.behrtorinho.jss.CitrixWorkspace-Autoupdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Virtualization</string>
		<key>GROUP_NAME</key>
		<string>update-automatic-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/SmartGroupTemplate-autoupdate.xml</string>
		<key>NAME</key>
		<string>Citrix Workspace</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Automatic</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/PolicyTemplate-autoupdate.xml</string>
		<key>SOFTWARETITLE</key>
		<string>Workspace</string>
		<key>VENDOR</key>
		<string>Citrix</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.jss.citrixworkspace</string>
</dict>
</plist>
