<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest Jamf Connect Login disk image, and builds a package, and uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.behrto.jss.JamfConnectLogin-Pilotgroup</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Computer management</string>
		<key>GROUP_NAME</key>
		<string>update-pilotgroup-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrto.behrtorecipes/Templates/SmartGroupTemplate-pilotgroup.xml</string>
		<key>NAME</key>
		<string>Jamf Connect Login</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Pilotgroup</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrto.behrtorecipes/Templates/PolicyTemplate-pilotgroup.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Jamf Connect Login is a product from Jamf to manage the Login of macOS Clients.</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.behrto.jss.JamfConnectLogin</string>
</dict>
</plist>