<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Transfers the package from the pre-downloaded DMG.</string>
    <key>Identifier</key>
    <string>com.github.behrto.pkg.JamfConnectLogin</string>
    <key>Input</key>
    <dict>
        <key>APP_FILENAME</key>
        <string>Jamf Connect Login</string>
        <key>BUNDLE_ID</key>
        <string>com.jamf.connect.login</string>
        <key>NAME</key>
        <string>JamfConnectLogin</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>ParentRecipe</key>
    <string>com.github.behrto.download.JamfConnect</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/* Login/*.pkg</string>
                <key>expected_authority_names</key>
                <array>
                    <string>Developer ID Installer: JAMF Software (483DWKW443)</string>
                    <string>Developer ID Certification Authority</string>
                    <string>Apple Root CA</string>
                </array>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%pathname%/* Login/*.pkg</string>
                <key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
                <key>purge_destination</key>
                <true/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>Copier</string>
			<key>Arguments</key>
			<dict>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/*.pkg/Payload</string>
                <key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                <key>overwrite</key>
                <true/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
                <key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload</string>
                <key>purge_destination</key>
                <true/>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/Library/Security/SecurityAgentPlugins/JamfConnectLogin.bundle/Contents/Info.plist</string>
			</dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>PkgCopier</string>
			<key>Arguments</key>
			<dict>
				<key>source_pkg</key>
				<string>%pathname%/* Login/*.pkg</string>
                <key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
		</dict>
    </array>
</dict>
</plist>