<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.behrto.jss.Zoom-Autoupdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>EXTENSION_ATTRIBUTE_NAME</key>
		<string>%NAME% Version</string>
		<key>EXTENSION_ATTRIBUTE_SCRIPT</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrto.behrtorecipes/Templates/ExtensionAttribute-CFBundleVersion.sh</string>
		<key>GROUP_NAME</key>
		<string>update-autoupdate-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrto.behrtorecipes/Templates/SmartGroupTemplate-autoupdate-EA-regex.xml</string>
		<key>JSS_INVENTORY_NAME</key>
		<string>zoom.us.app</string>
		<key>NAME</key>
		<string>Zoom</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Automatic</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrto.behrtorecipes/Templates/PolicyTemplate-autoupdate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>The Zoom app provides cloud-hosted video conferencing, plus online meetings and group messaging.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>Zoom.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.behrto.jss.Zoom</string>
</dict>
</plist>
