<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Devolutions Remote Desktop Manager.</string>
	<key>Identifier</key>
	<string>com.github.behrto.download.DevolutionsRemoteDesktopManager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Remote Desktop Manager</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string> Version ([\d\.]+)</string>
				<key>result_output_var_name</key>
				<string>data-g-platform="macos"
              data-g-version=</string>
				<key>url</key>
				<string>https://remotedesktopmanager.com/de/home/downloadenterprise/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://cdn.devolutions.net/download/Mac/Devolutions.RemoteDesktopManager.Mac.%version%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>