<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DevolutionsRemoteDesktopmanager and creates a package.</string>
	<key>Identifier</key>
	<string>local.pkg.DevolutionsRemoteDesktopmanager</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Remote Desktop Manager</string>
	</dict>
	<key>ParentRecipe</key>
	<string>local.download.DevolutionsRemoteDesktopmanager</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>local.download.DevolutionsRemoteDesktopmanager</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeOverrides/DevolutionsRemoteDesktopmanager.download.recipe</string>
				<key>sha256_hash</key>
				<string>0e3e912cbc6a0a929695e0dca8ec897ad40d58ce3fb76111cdcb15ff7de292c1</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
