<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of Audacity and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.behrto.pkg.Audacity</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NAME</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.behrto.download.Audacity</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>