Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.behrto.jamf.VLC
MinimumVersion: "2.3"
ParentRecipe: com.github.autopkg.pkg.VLC

Input:
  NAME: VLC
  CATEGORY: Productivity
  GROUP_NAME: "update-automatic-%NAME%"
  GROUP_TEMPLATE: SmartGroup-update-testgroup-automatic-regex.xml
  TESTING_GROUP_NAME: TestVLC
  POLICY_CATEGORY: Update Automatic
  POLICY_TEMPLATE: Policy-install-latest.xml
  POLICY_NAME: "Auto Update Test %NAME%"
  POLICY_RUN_COMMAND: "echo 'Update von %NAME% abgeschlossen'"
  UPDATE_PREDICATE: "pkg_uploaded == False"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"