
<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of FileZilla and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.behrto.pkg.FileZilla</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>org.filezilla-project.filezilla.pkg</string>
		<key>NAME</key>
		<string>FileZilla</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.behrto.download.FileZilla</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%/*.app</string>
				<key>force_pkg_build</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>