<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
	<key>Identifier</key>
	<string>com.github.behrto.jss.SourceTree_Pilotgroup</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Computer Science</string>
		<key>GROUP_NAME</key>
		<string>update-pilotgroup-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroup-update-pilotgroup-automatic-regex.xml</string>
		<key>TESTING_GROUP_NAME</key>
		<string>Pilotgroup SourceTree</string>
		<key>NAME</key>
		<string>SourceTree</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Pilotgroup</string>
		<key>POLICY_TEMPLATE</key>
		<string>Policy-update-automatic-selfservice.xml</string>
		<key>POLICY_NAME</key>
		<string>Update Pilotgroup %NAME%</string>
		<key>POLICY_RUN_COMMAND</key>
		<string>echo 'Update von %NAME% abgeschlossen'</string>
		<key>SCRIPT_NAME</key>
		<string>Scriptname.sh</string>
		<key>SCRIPT_PRIORITY</key>
		<string>After</string>
		<key>SELF_SERVICE_DISPLAY_NAME</key>
		<string>Update %NAME%</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>DESCRIPTION</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
		<key>INSTALL_BUTTON_TEXT</key>
		<string>Update</string>
		<key>REINSTALL_BUTTON_TEXT</key>
		<string>Update</string>
		<key>UPDATE_PREDICATE</key>
		<string>pkg_uploaded == False</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.SourceTree</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</string>
            <key>Arguments</key>
            <dict>
                <key>category_name</key>
                <string>%CATEGORY%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>%UPDATE_PREDICATE%</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>com.github.grahampugh.recipes.commonprocessors/VersionRegexGenerator</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader</string>
            <key>Arguments</key>
            <dict>
                <key>computergroup_template</key>
                <string>%GROUP_TEMPLATE%</string>
                <key>computergroup_name</key>
                <string>%GROUP_NAME%</string>
				<key>replace_group</key>
                <string>True</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader</string>
            <key>Arguments</key>
            <dict>
                <key>policy_template</key>
                <string>%POLICY_TEMPLATE%</string>
                <key>policy_name</key>
                <string>%POLICY_NAME%</string>
				<key>replace_policy</key>
                <string>True</string>
                <key>icon</key>
                <string>%SELF_SERVICE_ICON%</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>