<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.behrtorinho.jss.Visual Studio Code-Autoupdate</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>DOWNLOAD_URL</key>
		<string>https://go.microsoft.com/fwlink/?LinkID=620882</string>
		<key>GROUP_NAME</key>
		<string>update-automatic-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/SmartGroupTemplate-autoupdate.xml</string>
		<key>NAME</key>
		<string>Visual Studio Code</string>
		<key>PKG_ID</key>
		<string>com.microsoft.VSCode</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Automatic</string>
		<key>POLICY_TEMPLATE</key>
		<string>~/Library/AutoPkg/RecipeRepos/com.github.behrtorinho.behrtorecipes/Templates/PolicyTemplate-autoupdate.xml</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jss-recipes.jss.VisualStudioCode</string>
</dict>
</plist>
