<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest stable version of KeePassXC and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.behrto.pkg.KeePassXC</string>
	<key>Input</key>
	<dict>
        <key>SOFTWARETITLE</key>
        <string>KeePassXC</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.KeePassXC</string>
<key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>PkgRootCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkgroot</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                    <key>pkgdirs</key>
                    <dict>
                        <key>Applications</key>
                        <string>0775</string>
                    </dict>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Copier</string>
                <key>Arguments</key>
                <dict>
                    <key>source_path</key>
                    <string>%pathname%/KeePassXC.app</string>
                    <key>destination_path</key>
                    <string>%pkgroot%/Applications/KeePassXC.app</string>
                    <key>purge_destination</key>
                    <true/>
                </dict>
            </dict>
            <dict>
                <key>Processor</key>
                <string>Versioner</string>
                <key>Arguments</key>
                <dict>
                    <key>input_plist_path</key>
                    <string>%pkgroot%/Applications/KeePassXC.app/Contents/Info.plist</string>
                    <key>plist_version_key</key>
                    <string>CFBundleShortVersionString</string>
                </dict>
            </dict>
            <dict>
            <key>Processor</key>
			<string>PlistReader</string>
			<key>Arguments</key>
			<dict>
				<key>info_path</key>
				<string>%pkgroot%/Applications/APP.app</string>
				<key>plist_keys</key>
				<dict>
					<key>CFBundleIdentifier</key>
					<string>bundleid</string>
					<key>CFBundleName</key>
					<string>app_name</string>
				</dict>
			</dict>
		    </dict>
            <dict>
                <key>Processor</key>
                <string>PkgCreator</string>
                <key>Arguments</key>
                <dict>
                    <key>pkg_request</key>
                    <dict>
                        <key>pkgname</key>
                        <string>%SOFTWARETITLE%_%version%</string>
                        <key>version</key>
                        <string>%version%</string>
                        <key>id</key>
                        <string>%bundleid%</string>
                        <key>options</key>
                        <string>purge_ds_store</string>
                        <key>chown</key>
                        <array>
                            <dict>
                                <key>path</key>
                                <string>Applications</string>
                                <key>user</key>
                                <string>root</string>
                                <key>group</key>
                                <string>wheel</string>
                                <key>mode</key>
                                <string>0755</string>
                            </dict>
                        </array>
                    </dict>
                </dict>
            </dict>
        </array>
</dict>
</plist>