<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Version from APP and extracts the package. Then, uploads to the JSS and Create a Pilotgroup.</string>
	<key>Identifier</key>
	<string>local.jss.APP-Pilotgroup</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Production</string>
		<key>GROUP_NAME</key>
		<string>update-pilotgroup-%NAME%</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate-pilotgroup.xml</string>
		<key>NAME</key>
		<string>APP</string>
		<key>POLICY_CATEGORY</key>
		<string>Update Pilotgroup</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate-pilotgroup.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Neuste Version von %NAME% herunterladen.</string>
	</dict>
	<key>ParentRecipe</key>
	<string>PARENTRECIPE</string>
</dict>
</plist>
