<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of iTerm2 for Mac Client.</string>
    <key>Identifier</key>
    <string>com.github.behrto.download.iTerm2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>iTerm2</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
            	<!-- Due to the use of mirrors, the ETag and Modified Dates cannot be used -->
          		<key>CHECK_FILESIZE_ONLY</key>
          		<true/>
                <key>url</key>
                <string>https://iterm2.com/downloads/stable/latest</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
		</dict>

    </array>
</dict>
</plist>